In [1]:
#HANDLING MISSING DATA
import pandas as pd
import numpy as np

In [2]:

dict={
    'name':['bhanu','ramu','vishnu'],
    'place':['etah','warangal','daman'],
    'cpi':[9.63,8.9,9.43]
}

df=pd.DataFrame(dict)
df

     name     place   cpi
0   bhanu      etah  9.63
1    ramu  warangal  8.90
2  vishnu     daman  9.43

In [3]:
dict2 = {'name':['bharat'],'cpi':[6.00]}
new_df = pd.DataFrame(dict2)
df=pd.concat([df,new_df])
df

     name     place   cpi
0   bhanu      etah  9.63
1    ramu  warangal  8.90
2  vishnu     daman  9.43
0  bharat       NaN  6.00

In [4]:
#now in our datafrme we got a missing value denoted by NaN

#there are many ways to handle it so let's make copies of data ser
df2=df.copy()
#1) now we are going to drop them
df2.dropna()

     name     place   cpi
0   bhanu      etah  9.63
1    ramu  warangal  8.90
2  vishnu     daman  9.43

In [5]:
#calling dropna with arguments

#axis argument can be set to either index(for rows) or columns
#how argument ----
# any - it will drop if any of the values is nan
# all - it will drop if each value of row or column is nan
df2.dropna(axis='index',how='any')

     name     place   cpi
0   bhanu      etah  9.63
1    ramu  warangal  8.90
2  vishnu     daman  9.43

In [6]:
df2.dropna(axis='index',how='all')

     name     place   cpi
0   bhanu      etah  9.63
1    ramu  warangal  8.90
2  vishnu     daman  9.43
0  bharat       NaN  6.00

In [7]:
#now we are interested in droping the coumn or row if it has 
#not cpi 
#subset argument -- here we can pass a list of couumns that we 
#want to look for the nan values
df2.dropna(axis='index',subset=['cpi'])

     name     place   cpi
0   bhanu      etah  9.63
1    ramu  warangal  8.90
2  vishnu     daman  9.43
0  bharat       NaN  6.00

In [8]:
df2

     name     place   cpi
0   bhanu      etah  9.63
1    ramu  warangal  8.90
2  vishnu     daman  9.43
0  bharat       NaN  6.00

In [9]:
df2 = pd.concat([df2,pd.DataFrame({'name':['Bharat'],'place':'rajasthan'})])

In [10]:
df2

     name      place   cpi
0   bhanu       etah  9.63
1    ramu   warangal  8.90
2  vishnu      daman  9.43
0  bharat        NaN  6.00
0  Bharat  rajasthan   NaN

In [11]:
df2.dropna(axis='index',subset=['place','cpi'],how='any')   #looks for the nan only in the specified columns
#Not working well don't know why

     name     place   cpi
0   bhanu      etah  9.63
1    ramu  warangal  8.90
2  vishnu     daman  9.43

In [12]:
#now suppose we get a data in which missing values are represented by n/a but NaN is what we need for dropna method
df2.replace('NA',np.nan, inplace=True)
df2.replace('missing',np.nan,inplace=True)

In [13]:
#now there maybe a case that we are working with a df of marks 
#and nan or na denotes that student didn't appear in test
#now we are trying to make all na to zero
df2=pd.concat([df2,pd.DataFrame({'name':['bharat'],'cpi':[6.00]})])
df2

     name      place   cpi
0   bhanu       etah  9.63
1    ramu   warangal  8.90
2  vishnu      daman  9.43
0  bharat        NaN  6.00
0  Bharat  rajasthan   NaN
0  bharat        NaN  6.00

In [14]:
df2.drop([0], inplace=True)
df2

     name     place   cpi
1    ramu  warangal  8.90
2  vishnu     daman  9.43

In [15]:
df2.fillna(0)

     name     place   cpi
1    ramu  warangal  8.90
2  vishnu     daman  9.43

In [16]:
#CASTING DATA TYPE
df.dtypes

name      object
place     object
cpi      float64
dtype: object

In [17]:
#here cpi is a float but it may not be float sometimes in that case we need to typecast
df2['cpi']=df2['cpi'].astype(int)
df2

     name     place  cpi
1    ramu  warangal    8
2  vishnu     daman    9

In [18]:
#but if we have a nan value in our column we can convert it 
#only to a float